node {
  name: "input/x-input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "input/x-input-img/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\377\377\377\377\034\000\000\000\034\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "input/x-input-img"
  op: "Reshape"
  input: "input/x-input"
  input: "input/x-input-img/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Conv._Layer_1/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000\001\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "Conv._Layer_1/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Conv._Layer_1/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Conv._Layer_1/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Conv._Layer_1/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Conv._Layer_1/truncated_normal/mul"
  op: "Mul"
  input: "Conv._Layer_1/truncated_normal/TruncatedNormal"
  input: "Conv._Layer_1/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv._Layer_1/truncated_normal"
  op: "Add"
  input: "Conv._Layer_1/truncated_normal/mul"
  input: "Conv._Layer_1/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv._Layer_1/weight_var"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 1
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv._Layer_1/weight_var/Assign"
  op: "Assign"
  input: "Conv._Layer_1/weight_var"
  input: "Conv._Layer_1/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv._Layer_1/weight_var"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv._Layer_1/weight_var/read"
  op: "Identity"
  input: "Conv._Layer_1/weight_var"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv._Layer_1/weight_var"
      }
    }
  }
}
node {
  name: "Conv._Layer_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Conv._Layer_1/bias_var"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv._Layer_1/bias_var/Assign"
  op: "Assign"
  input: "Conv._Layer_1/bias_var"
  input: "Conv._Layer_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv._Layer_1/bias_var"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv._Layer_1/bias_var/read"
  op: "Identity"
  input: "Conv._Layer_1/bias_var"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv._Layer_1/bias_var"
      }
    }
  }
}
node {
  name: "Conv._Layer_1/Conv2D"
  op: "Conv2D"
  input: "input/x-input-img"
  input: "Conv._Layer_1/weight_var/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "Conv._Layer_1/add"
  op: "Add"
  input: "Conv._Layer_1/Conv2D"
  input: "Conv._Layer_1/bias_var/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv._Layer_1/Relu"
  op: "Relu"
  input: "Conv._Layer_1/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv._Layer_1/MaxPool"
  op: "MaxPool"
  input: "Conv._Layer_1/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\005\000\000\000\005\000\000\000 \000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "Conv.Layer_2/Convolution/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/truncated_normal/mul"
  op: "Mul"
  input: "Conv.Layer_2/Convolution/truncated_normal/TruncatedNormal"
  input: "Conv.Layer_2/Convolution/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/truncated_normal"
  op: "Add"
  input: "Conv.Layer_2/Convolution/truncated_normal/mul"
  input: "Conv.Layer_2/Convolution/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/weight_var"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 5
        }
        dim {
          size: 5
        }
        dim {
          size: 32
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/weight_var/Assign"
  op: "Assign"
  input: "Conv.Layer_2/Convolution/weight_var"
  input: "Conv.Layer_2/Convolution/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv.Layer_2/Convolution/weight_var"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/weight_var/read"
  op: "Identity"
  input: "Conv.Layer_2/Convolution/weight_var"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv.Layer_2/Convolution/weight_var"
      }
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/bias_var"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/bias_var/Assign"
  op: "Assign"
  input: "Conv.Layer_2/Convolution/bias_var"
  input: "Conv.Layer_2/Convolution/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv.Layer_2/Convolution/bias_var"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/bias_var/read"
  op: "Identity"
  input: "Conv.Layer_2/Convolution/bias_var"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv.Layer_2/Convolution/bias_var"
      }
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/Conv2D"
  op: "Conv2D"
  input: "Conv._Layer_1/MaxPool"
  input: "Conv.Layer_2/Convolution/weight_var/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/add"
  op: "Add"
  input: "Conv.Layer_2/Convolution/Conv2D"
  input: "Conv.Layer_2/Convolution/bias_var/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/Relu"
  op: "Relu"
  input: "Conv.Layer_2/Convolution/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv.Layer_2/Convolution/MaxPool"
  op: "MaxPool"
  input: "Conv.Layer_2/Convolution/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "Conv.Layer_2/Flatten_Conv_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377@\014\000\000"
      }
    }
  }
}
node {
  name: "Conv.Layer_2/Flatten_Conv_2"
  op: "Reshape"
  input: "Conv.Layer_2/Convolution/MaxPool"
  input: "Conv.Layer_2/Flatten_Conv_2/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\014\000\000\004\004\000\000"
      }
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "FC_Layer_1/FC_Layer_1/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/truncated_normal/mul"
  op: "Mul"
  input: "FC_Layer_1/FC_Layer_1/truncated_normal/TruncatedNormal"
  input: "FC_Layer_1/FC_Layer_1/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/truncated_normal"
  op: "Add"
  input: "FC_Layer_1/FC_Layer_1/truncated_normal/mul"
  input: "FC_Layer_1/FC_Layer_1/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/weight_var"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3136
        }
        dim {
          size: 1028
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/weight_var/Assign"
  op: "Assign"
  input: "FC_Layer_1/FC_Layer_1/weight_var"
  input: "FC_Layer_1/FC_Layer_1/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@FC_Layer_1/FC_Layer_1/weight_var"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/weight_var/read"
  op: "Identity"
  input: "FC_Layer_1/FC_Layer_1/weight_var"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@FC_Layer_1/FC_Layer_1/weight_var"
      }
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1028
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/bias_var"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1028
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/bias_var/Assign"
  op: "Assign"
  input: "FC_Layer_1/FC_Layer_1/bias_var"
  input: "FC_Layer_1/FC_Layer_1/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@FC_Layer_1/FC_Layer_1/bias_var"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/bias_var/read"
  op: "Identity"
  input: "FC_Layer_1/FC_Layer_1/bias_var"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@FC_Layer_1/FC_Layer_1/bias_var"
      }
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/MatMul"
  op: "MatMul"
  input: "Conv.Layer_2/Flatten_Conv_2"
  input: "FC_Layer_1/FC_Layer_1/weight_var/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "FC_Layer_1/FC_Layer_1/add"
  op: "Add"
  input: "FC_Layer_1/FC_Layer_1/MatMul"
  input: "FC_Layer_1/FC_Layer_1/bias_var/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_1/ReLu"
  op: "Relu"
  input: "FC_Layer_1/FC_Layer_1/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/dropout/Shape"
  op: "Shape"
  input: "FC_Layer_1/ReLu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/dropout/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/dropout/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/dropout/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "FC_Layer_1/Dropout/dropout/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/dropout/random_uniform/sub"
  op: "Sub"
  input: "FC_Layer_1/Dropout/dropout/random_uniform/max"
  input: "FC_Layer_1/Dropout/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/dropout/random_uniform/mul"
  op: "Mul"
  input: "FC_Layer_1/Dropout/dropout/random_uniform/RandomUniform"
  input: "FC_Layer_1/Dropout/dropout/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/dropout/random_uniform"
  op: "Add"
  input: "FC_Layer_1/Dropout/dropout/random_uniform/mul"
  input: "FC_Layer_1/Dropout/dropout/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/dropout/add"
  op: "Add"
  input: "FC_Layer_1/Dropout/Placeholder"
  input: "FC_Layer_1/Dropout/dropout/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/dropout/Floor"
  op: "Floor"
  input: "FC_Layer_1/Dropout/dropout/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/dropout/div"
  op: "RealDiv"
  input: "FC_Layer_1/ReLu"
  input: "FC_Layer_1/Dropout/Placeholder"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_1/Dropout/dropout/mul"
  op: "Mul"
  input: "FC_Layer_1/Dropout/dropout/div"
  input: "FC_Layer_1/Dropout/dropout/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_2/truncated_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\004\004\000\000\n\000\000\000"
      }
    }
  }
}
node {
  name: "FC_Layer_2/truncated_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "FC_Layer_2/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "FC_Layer_2/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "FC_Layer_2/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "FC_Layer_2/truncated_normal/mul"
  op: "Mul"
  input: "FC_Layer_2/truncated_normal/TruncatedNormal"
  input: "FC_Layer_2/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_2/truncated_normal"
  op: "Add"
  input: "FC_Layer_2/truncated_normal/mul"
  input: "FC_Layer_2/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "FC_Layer_2/weight_var"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1028
        }
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "FC_Layer_2/weight_var/Assign"
  op: "Assign"
  input: "FC_Layer_2/weight_var"
  input: "FC_Layer_2/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@FC_Layer_2/weight_var"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "FC_Layer_2/weight_var/read"
  op: "Identity"
  input: "FC_Layer_2/weight_var"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@FC_Layer_2/weight_var"
      }
    }
  }
}
node {
  name: "FC_Layer_2/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 10
          }
        }
        float_val: 0.10000000149011612
      }
    }
  }
}
node {
  name: "FC_Layer_2/bias_var"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "FC_Layer_2/bias_var/Assign"
  op: "Assign"
  input: "FC_Layer_2/bias_var"
  input: "FC_Layer_2/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@FC_Layer_2/bias_var"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "FC_Layer_2/bias_var/read"
  op: "Identity"
  input: "FC_Layer_2/bias_var"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@FC_Layer_2/bias_var"
      }
    }
  }
}
node {
  name: "FC_Layer_2/MatMul"
  op: "MatMul"
  input: "FC_Layer_1/Dropout/dropout/mul"
  input: "FC_Layer_2/weight_var/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "FC_Layer_2/add"
  op: "Add"
  input: "FC_Layer_2/MatMul"
  input: "FC_Layer_2/bias_var/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Output"
  op: "Softmax"
  input: "FC_Layer_2/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Training/Training_Input/y"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "Training/Cost_Function/Rank"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "Training/Cost_Function/Shape"
  op: "Shape"
  input: "FC_Layer_2/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Rank_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "Training/Cost_Function/Shape_1"
  op: "Shape"
  input: "FC_Layer_2/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Sub/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Training/Cost_Function/Sub"
  op: "Sub"
  input: "Training/Cost_Function/Rank_1"
  input: "Training/Cost_Function/Sub/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Slice/begin"
  op: "Pack"
  input: "Training/Cost_Function/Sub"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "Training/Cost_Function/Slice/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Training/Cost_Function/Slice"
  op: "Slice"
  input: "Training/Cost_Function/Shape_1"
  input: "Training/Cost_Function/Slice/begin"
  input: "Training/Cost_Function/Slice/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/concat/values_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "Training/Cost_Function/concat/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Training/Cost_Function/concat"
  op: "ConcatV2"
  input: "Training/Cost_Function/concat/values_0"
  input: "Training/Cost_Function/Slice"
  input: "Training/Cost_Function/concat/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Reshape"
  op: "Reshape"
  input: "FC_Layer_2/add"
  input: "Training/Cost_Function/concat"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Rank_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "Training/Cost_Function/Shape_2"
  op: "Shape"
  input: "Training/Training_Input/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Sub_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Training/Cost_Function/Sub_1"
  op: "Sub"
  input: "Training/Cost_Function/Rank_2"
  input: "Training/Cost_Function/Sub_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Slice_1/begin"
  op: "Pack"
  input: "Training/Cost_Function/Sub_1"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "Training/Cost_Function/Slice_1/size"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Training/Cost_Function/Slice_1"
  op: "Slice"
  input: "Training/Cost_Function/Shape_2"
  input: "Training/Cost_Function/Slice_1/begin"
  input: "Training/Cost_Function/Slice_1/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/concat_1/values_0"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "Training/Cost_Function/concat_1/axis"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Training/Cost_Function/concat_1"
  op: "ConcatV2"
  input: "Training/Cost_Function/concat_1/values_0"
  input: "Training/Cost_Function/Slice_1"
  input: "Training/Cost_Function/concat_1/axis"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Reshape_1"
  op: "Reshape"
  input: "Training/Training_Input/y"
  input: "Training/Cost_Function/concat_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Cost_Function"
  op: "SoftmaxCrossEntropyWithLogits"
  input: "Training/Cost_Function/Reshape"
  input: "Training/Cost_Function/Reshape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Training/Cost_Function/Sub_2/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Training/Cost_Function/Sub_2"
  op: "Sub"
  input: "Training/Cost_Function/Rank"
  input: "Training/Cost_Function/Sub_2/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Slice_2/begin"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Training/Cost_Function/Slice_2/size"
  op: "Pack"
  input: "Training/Cost_Function/Sub_2"
  attr {
    key: "N"
    value {
      i: 1
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "Training/Cost_Function/Slice_2"
  op: "Slice"
  input: "Training/Cost_Function/Shape"
  input: "Training/Cost_Function/Slice_2/begin"
  input: "Training/Cost_Function/Slice_2/size"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Reshape_2"
  op: "Reshape"
  input: "Training/Cost_Function/Cost_Function"
  input: "Training/Cost_Function/Slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Cost_Function/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Training/Cost_Function/Mean"
  op: "Mean"
  input: "Training/Cost_Function/Reshape_2"
  input: "Training/Cost_Function/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Fill"
  op: "Fill"
  input: "Training/Optimizer/gradients/Shape"
  input: "Training/Optimizer/gradients/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Reshape"
  op: "Reshape"
  input: "Training/Optimizer/gradients/Fill"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Shape"
  op: "Shape"
  input: "Training/Cost_Function/Reshape_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Tile"
  op: "Tile"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Reshape"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Shape_1"
  op: "Shape"
  input: "Training/Cost_Function/Reshape_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Shape_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Prod"
  op: "Prod"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Shape_1"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Prod_1"
  op: "Prod"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Shape_2"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Const_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Maximum/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Maximum"
  op: "Maximum"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Prod_1"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Maximum/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/floordiv"
  op: "FloorDiv"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Prod"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Maximum"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Cast"
  op: "Cast"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/floordiv"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/truediv"
  op: "RealDiv"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Tile"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/Cast"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Reshape_2_grad/Shape"
  op: "Shape"
  input: "Training/Cost_Function/Cost_Function"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Reshape_2_grad/Reshape"
  op: "Reshape"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Mean_grad/truediv"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Reshape_2_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/zeros_like"
  op: "ZerosLike"
  input: "Training/Cost_Function/Cost_Function:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Cost_Function_grad/PreventGradient"
  op: "PreventGradient"
  input: "Training/Cost_Function/Cost_Function:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Cost_Function_grad/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Cost_Function_grad/ExpandDims"
  op: "ExpandDims"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Reshape_2_grad/Reshape"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Cost_Function_grad/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Cost_Function_grad/mul"
  op: "Mul"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Cost_Function_grad/ExpandDims"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Cost_Function_grad/PreventGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Reshape_grad/Shape"
  op: "Shape"
  input: "FC_Layer_2/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/Training/Cost_Function/Reshape_grad/Reshape"
  op: "Reshape"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Cost_Function_grad/mul"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Reshape_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Shape"
  op: "Shape"
  input: "FC_Layer_2/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Shape_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 10
      }
    }
  }
}
node {
  name: "Training/Optimizer/gradients/FC_Layer_2/add_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Shape"
  input: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Sum"
  op: "Sum"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Reshape_grad/Reshape"
  input: "Training/Optimizer/gradients/FC_Layer_2/add_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Reshape"
  op: "Reshape"
  input: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Sum"
  input: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Sum_1"
  op: "Sum"
  input: "Training/Optimizer/gradients/Training/Cost_Function/Reshape_grad/Reshape"
  input: "Training/Optimizer/gradients/FC_Layer_2/add_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Reshape_1"
  op: "Reshape"
  input: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Sum_1"
  input: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Training/Optimizer/gradients/FC_Layer_2/add_grad/tuple/group_deps"
  op: "NoOp"
  input: "^Training/Optimizer/gradients/FC_Layer_2/add_grad/Reshape"
  input: "^Training/Optimizer/gradients/FC_Layer_2/add_grad/Reshape_1"
}
node {
  name: "Training/Optimizer/gradients/FC_Layer_2/add_grad/tuple/control_dependency"
  op: "Identity"
  input: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Reshape"
  input: "^Training/Optimizer/gradients/FC_Layer_2/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Training/Optimizer/gradients/FC_Layer_2/add_grad/Reshape"
      }
    }
  }
}
node {
  name: "Training/Optimizer/gradients/FC_Layer_2/add_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "Training/Optimizer/gradients/FC_Layer_2/add_grad/Reshape_1"
  input: "^Training/Optimizer/gradients/FC_Layer_2/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Training/Optimizer/gradients/FC_Layer_2/add_grad/Reshape_1"
      }
    }
  }
}
node {
  name: "Training/Optimizer/gradients/FC_Layer_2/MatMul_grad/MatMul"
  op: "MatMul"
  input: "Training/Optimizer/gradients/FC_Layer_2/add_grad/tuple/control_dependency"
  input: "FC_Layer_2/weight_var/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
